wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
/**********************************************************************
 * Copyright (c) 2018 - 2021 by WangYu
 * All rights reserved
 *
 * Filename:  stm32f746g_disco.c
 * Project:   Minimum RTOS platform
 * Date:      2021/9/5
 * Author:    WangYu
 *
 **********************************************************************/
#include <stdint.h>
#include <string.h>
#include "debug.h"
#include "assert_param.h"
#include "font.h"
#include "image.h"
#include "stm32f746xx.h"
#include "stm32f746g_disco.h"
#include "ft5336.h"

// Clock constant value definition
#define PLLM							((uint32_t)( 25 <<  0))
#define PLLN							((uint32_t)(432 <<  6))
#define PLLP							((uint32_t)(  0 << 16)) // pay attention to this value!!
#define PLLSRC							((uint32_t)(  1 << 22))
#define PLLQ							((uint32_t)(  9 << 24))

// LCD constant value definition
#define COLOR_BYTE_ARGB8888				(4)
#define COLOR_BYTE_RGB888				(3)
#define LCD_FRAME_BUF_BYTES				COLOR_BYTE_ARGB8888
#define LCD_FRAME_BUF_SIZE				(LCD_FRAME_BUF_BYTES * LCD_ACTIVE_WIDTH * LCD_ACTIVE_HEIGHT)
#define LCD_HSYNC						(41)
#define LCD_VSYNC						(10)
#define LCD_HBP							(13)
#define LCD_HFP							(32)
#define LCD_VBP							(2)
#define LCD_VFP							(2)

// SD Command definition
#define SD_CMD_GO_IDLE_STATE        	(0)		// Resets the SD memory card.                                                               
#define SD_CMD_SEND_OP_COND         	(1)		// Sends host capacity support information and activates the card's initialization process. 
#define SD_CMD_ALL_SEND_CID         	(2)		// Asks any card connected to the host to send the CID numbers on the CMD line.             
#define SD_CMD_SET_REL_ADDR         	(3)		// Asks the card to publish a new relative address (RCA).                                   
#define SD_CMD_SET_DSR              	(4)		// Programs the DSR of all cards.                                                           
#define SD_CMD_SDMMC_SEN_OP_COND    	(5)		// Sends host capacity support information (HCS) and asks the accessed card to send its operating condition register (OCR) content in the response on the CMD line.
#define SD_CMD_HS_SWITCH            	(6)		// Checks switchable function (mode 0) and switch card function (mode 1).                   
#define SD_CMD_SEL_DESEL_CARD       	(7)		// Selects the card by its own relative address and gets deselected by any other address    
#define SD_CMD_HS_SEND_EXT_CSD      	(8)		// Sends SD Memory Card interface condition, which includes host supply voltage information and asks the card whether card supports voltage.
#define SD_CMD_SEND_CSD             	(9)		// Addressed card sends its card specific data (CSD) on the CMD line.                       
#define SD_CMD_SEND_CID             	(10)	// Addressed card sends its card identification (CID) on the CMD line.                      
#define SD_CMD_READ_DAT_UNTIL_STOP  	(11)	// SD card doesn't support it.                                                              
#define SD_CMD_STOP_TRANSMISSION    	(12)	// Forces the card to stop transmission.                                                    
#define SD_CMD_SEND_STATUS          	(13)	// Addressed card sends its status register.                                                
#define SD_CMD_HS_BUSTEST_READ      	(14)	// Reserved                                                                                 
#define SD_CMD_GO_INACTIVE_STATE    	(15)	// Sends an addressed card into the inactive state.                                         
#define SD_CMD_SET_BLOCKLEN         	(16)	// Sets the block length (in bytes for SDSC) for all following block commands (read, write, lock). Default block length is fixed to 512 Bytes. Not effective for SDHS and SDXC.                                                                       
#define SD_CMD_READ_SINGLE_BLOCK    	(17)	// Reads single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of fixed 512 bytes in case of SDHC and SDXC.                                                
#define SD_CMD_READ_MULT_BLOCK      	(18)	// Continuously transfers data blocks from card to host until interrupted by STOP_TRANSMISSION command.                                                               
#define SD_CMD_HS_BUSTEST_WRITE     	(19)	// 64 bytes tuning pattern is sent for SDR50 and SDR104.                                    
#define SD_CMD_WRITE_DAT_UNTIL_STOP 	(20)	// Speed class control command.                                                             
#define SD_CMD_SET_BLOCK_COUNT      	(23)	// Specify block count for CMD18 and CMD25.                                                 
#define SD_CMD_WRITE_SINGLE_BLOCK   	(24)	// Writes single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of fixed 512 bytes in case of SDHC and SDXC.                                                
#define SD_CMD_WRITE_MULT_BLOCK     	(25)	// Continuously writes blocks of data until a STOP_TRANSMISSION follows.                    
#define SD_CMD_PROG_CID             	(26)	// Reserved for manufacturers.                                                              
#define SD_CMD_PROG_CSD             	(27)	// Programming of the programmable bits of the CSD.                                         
#define SD_CMD_SET_WRITE_PROT       	(28)	// Sets the write protection bit of the addressed group.                                    
#define SD_CMD_CLR_WRITE_PROT       	(29)	// Clears the write protection bit of the addressed group.                                  
#define SD_CMD_SEND_WRITE_PROT      	(30)	// Asks the card to send the status of the write protection bits.                           
#define SD_CMD_SD_ERASE_GRP_START   	(32)	// Sets the address of the first write block to be erased. (For SD card only).              
#define SD_CMD_SD_ERASE_GRP_END     	(33)	// Sets the address of the last write block of the continuous range to be erased.           
#define SD_CMD_ERASE_GRP_START      	(35)	// Sets the address of the first write block to be erased. Reserved for each command system set by switch function command (CMD6).                                            
#define SD_CMD_ERASE_GRP_END        	(36)	// Sets the address of the last write block of the continuous range to be erased.           
												// Reserved for each command system set by switch function command (CMD6).                  
#define SD_CMD_ERASE                	(38)	// Reserved for SD security applications.                                                   
#define SD_CMD_FAST_IO              	(39)	// SD card doesn't support it (Reserved).                                                   
#define SD_CMD_GO_IRQ_STATE         	(40)	// SD card doesn't support it (Reserved).                                                   
#define SD_CMD_LOCK_UNLOCK          	(42)	// Sets/resets the password or lock/unlock the card. The size of the data block is set by the SET_BLOCK_LEN command.                                                               
#define SD_CMD_APP_CMD              	(55)	// Indicates to the card that the next command is an application specific command rather than a standard command.                                                                 
#define SD_CMD_GEN_CMD              	(56)	// Used either to transfer a data block to the card or to get a data block from the card for general purpose/application specific commands.                                       
#define SD_CMD_NO_CMD               	(64)	// No command

#define SD_CMD_APP_SD_SET_BUSWIDTH      (6)		// (ACMD6) Defines the data bus width to be used for data transfer. The allowed data bus widths are given in SCR register.
#define SD_CMD_SD_APP_STATUS            (13)	// (ACMD13) Sends the SD status.
#define SD_CMD_SD_APP_SEND_NUM_WRITE_BLOCKS (22) // (ACMD22) Sends the number of the written (without errors) write blocks. Responds with 32bit+CRC data block.
#define SD_CMD_SD_APP_OP_COND			(41)   	// (ACMD41) Sends host capacity support information (HCS) and asks the accessed card to send its operating condition register (OCR) content in the response on the CMD line.
#define SD_CMD_SD_APP_SET_CLR_CARD_DETECT	(42) //(ACMD42) Connect/Disconnect the 50 KOhm pull-up resistor on CD/DAT3 (pin 1) of the card
#define SD_CMD_SD_APP_SEND_SCR			(51)	// Reads the SD Configuration Register (SCR).
#define SD_CMD_SDMMC_RW_DIRECT			(52)	// For SD I/O card only, reserved for security specification.
#define SD_CMD_SDMMC_RW_EXTENDED		(53)	// For SD I/O card only, reserved for security specification.

#define SD_SEND_CMD_TIMEOUT_CNT			(5000 * (216000000 / 8 / 1000))
#define SD_CMD_RESP_R1_ERRORBITS		(0xFDFFE008)
#define SD_CMD_RESP_R6_ERRORBITS		(0x0000E000)

uint8_t __attribute__( ( section(".sdram" ) ) ) __attribute__( ( aligned(4) ) )   charBuffer[12 * 16 * COLOR_BYTE_ARGB8888];
uint8_t __attribute__( ( section(".sdram" ) ) ) __attribute__( ( aligned(4) ) ) frameBuffer1[LCD_FRAME_BUF_SIZE];
uint8_t __attribute__( ( section(".sdram" ) ) ) __attribute__( ( aligned(4) ) ) frameBuffer2[LCD_FRAME_BUF_SIZE];
SD_INFO __attribute__( ( aligned(4) ) ) sdcard;

static void initFPU(void);
static void initSystemClock(void);
static void initSDRAM(void);
static void initSystick(void);
static void initUSART1(void);
static void initTouchPanel(void);
static void initLCD(void);
static void initDMA2D(void);
static void initLED1(void);
static void initSDMMC(void);
static uint8_t initSDCard(void);
#ifdef MODE_STAND_ALONE
static void initTIM7(void);
#endif
static void initNVICPriority(void);

