wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
static void initSDRAMGPIO(void);
static void initUartGPIO(void);
static void initLED1GPIO(void);
static void initLCDGPIO(void);
static void initTouchPanelGPIO(void);
static void initSDMMCGPIO(void);

static void setCharBuf06x08(
		const uint16_t  symbol,
		const uint32_t foreColor,
		const uint32_t backColor);
static void setCharBuf12x16(
		const uint16_t  symbol,
		const uint32_t foreColor,
		const uint32_t backColor);

static void sdmmcSendCmd(uint8_t cmd, uint32_t arg);
static uint8_t sdmmcCheckCmdError(void);
static uint8_t sdmmcCheckCmdResp1(uint8_t cmd);
static uint8_t sdmmcCheckCmdResp2(void);
static uint8_t sdmmcCheckCmdResp3(void);
static uint8_t sdmmcCheckCmdResp6(uint8_t cmd, uint16_t* pRca);
static uint8_t sdmmcCheckCmdResp7(void);

// External API function group
void SystemInit(void)
{
	SCB_EnableICache();
	SCB_EnableDCache();
	initFPU();
	initSystemClock();
	initSDRAM();
	initNVICPriority();
	initUSART1();
	TRACE("STM32F746G-DISCO starts to power up...\r\n");
	initLED1();
	initLCD();
	TRACE("1. LCD initialization is success.\r\n");
	initTouchPanel();
	TRACE("2. Touch panel initialization is success.\r\n");
	initSDMMC();
	char* msg[2] = {
		"3. SD card is not inserted.\r\n",
		"3. SD card identification is success.\r\n"
	};
	TRACE(msg[initSDCard()]);
	initSystick();
#ifdef MODE_STAND_ALONE
	initTIM7();
#endif
	TRACE("\r\n");
}

void usart1SendChar(const uint8_t character)
{
	while((USART1->ISR & USART_ISR_TC_Msk) == 0);
	USART1->TDR = (uint32_t)character;
}

uint8_t usart1ReceiveChar(void)
{
	while((USART1->ISR & USART_ISR_RXNE_Msk) == 0);
	return (uint8_t)(USART1->RDR & 0xFF);
}

void usart1Send(const uint8_t* message)
{
	USART1->CR1	|= USART_CR1_TE;
	for(uint32_t i = 0; i < strlen((const char*)message); i++) {
		USART1->TDR = message[i];
		while((USART1->ISR & USART_ISR_TXE_Msk) == 0);
	}
	while((USART1->ISR & USART_ISR_TC_Msk) == 0);
	USART1->CR1	&= ~USART_CR1_TE;
}


// for 7bits slave address and 8bits memory address
void i2c3Write1Byte(uint8_t slaveAddr, uint8_t devAddr, uint8_t data)
{
	// Wait previous I2C operation complete
	while (I2C3->ISR & I2C_ISR_BUSY);

	// Set master communication to write mode for send device address and data
	I2C3->CR2	=	I2C_CR2_AUTOEND |
					2 << I2C_CR2_NBYTES_Pos |	// send 2 bytes (address + data)
					I2C_CR2_START |
					0b0 << I2C_CR2_RD_WRN_Pos |	// write
					slaveAddr << I2C_CR2_SADD_Pos;

	// Send device address and data
	while ((I2C3->ISR & I2C_ISR_TXIS_Msk) == 0);
	I2C3->TXDR	=	devAddr;
	while ((I2C3->ISR & I2C_ISR_TXIS_Msk) == 0);
	I2C3->TXDR	=	data;
	// No need to Check TC flag, with AUTOEND mode the stop is automatically generated
	//while ((I2C3->ISR & I2C_ISR_TC_Msk) == 0);
	while ((I2C3->ISR & I2C_ISR_STOPF_Msk) == 0);
	I2C3->ICR	|=	I2C_ICR_STOPCF;
}

// for 7bits slave address and 8bits memory address
uint8_t i2c3Read1Byte(uint8_t slaveAddr, uint8_t devAddr)
{
	uint8_t data;

	// Wait previous I2C operation complete
	while (I2C3->ISR & I2C_ISR_BUSY_Msk);

	// Set master communication to write mode for send device address
	I2C3->CR2	=	1 << I2C_CR2_NBYTES_Pos |
					I2C_CR2_START |
					0b0 << I2C_CR2_RD_WRN_Pos | // write
					slaveAddr << I2C_CR2_SADD_Pos;
	while ((I2C3->ISR & I2C_ISR_TXIS_Msk) == 0);
	I2C3->TXDR	=	devAddr;
	while ((I2C3->ISR & I2C_ISR_TC_Msk) == 0);

	// Set master communication to read mode for receive data
	I2C3->CR2	=	I2C_CR2_AUTOEND |
					1 << I2C_CR2_NBYTES_Pos |
					I2C_CR2_START |
					0b1 << I2C_CR2_RD_WRN_Pos | // read
					slaveAddr << I2C_CR2_SADD_Pos;
	while ((I2C3->ISR & I2C_ISR_RXNE_Msk) == 0);
	data		=	(uint8_t)I2C3->RXDR;
	while ((I2C3->ISR & I2C_ISR_STOPF_Msk) == 0);
	I2C3->ICR	|=	I2C_ICR_STOPCF;

	return data;
}

void toggleLED1(void)
{
	uint32_t data = GPIOI->ODR & GPIO_ODR_OD1_Msk;
	GPIOI->ODR &= ~GPIO_ODR_OD1_Msk;
	GPIOI->ODR |= (~data) & GPIO_ODR_OD1_Msk;
}

uint8_t isSDCardInsert(void)
{
	uint8_t res = !(uint8_t)((GPIOC->IDR & GPIO_IDR_ID13_Msk) >> GPIO_IDR_ID13_Pos);
	return res;
}

void showLogo(void)
{
	drawImage(0, 0, 480, 272, (uint32_t)&logoImage, COLOR_RGB888, LAYER_FG);
}

void checkDMA2D(void)
{
	fillRect(0,  0,  480, 272, 0x00000000, LAYER_FG); // clear logo
	fillRect(0,  0,  480, 272, 0xFFA9A9A9, LAYER_BG);
	fillRect(50, 50, 380, 132, 0xFF8B0000, LAYER_BG);
	drawString(70,  60,  0xFFA9A9A9, 0x008B0000, "Welcome to STM32F746G-DISCO!", FONT_MIDDLE, LAYER_FG);
	drawString(280, 120, 0xFFA9A9A9, 0x008B0000, "Author : Wang.Yu", FONT_SMALL, LAYER_FG);
	drawString(280, 150, 0xFFA9A9A9, 0x008B0000, "  Date : 2021/9/1", FONT_SMALL, LAYER_FG);
	//drawString(70,  80,  0xFFA9A9A9, 0x008B0000, "abcdefghijklmnopqrstuvwxyz", FONT_SMALL, LAYER_FG);
	//drawString(70,  100, 0xFFA9A9A9, 0x008B0000, "abcdefghijklmnopqrstuvwxyz", FONT_MIDDLE, LAYER_FG);
}

uint16_t checkSDRAM(void)
{
	uint8_t* p;
	uint8_t* startAddr	= (uint8_t*)&_ssdram;
	uint8_t* endAddr	= (uint8_t*)((uint32_t)&_ssdram + (uint32_t)&_sdram_size - 1);

	// check after write
	for (p = startAddr; p <= endAddr; p += 0x100000) {
		*p = 0xA5;
		if ((*p) != 0xA5) return 0;
	}
	*endAddr = 0x5A;
	if ((*endAddr) != 0x5A) return 0;

	// check delay
	for (volatile uint32_t i = 0; i < 1000000; i++);
	for (p = startAddr; p <= endAddr; p += 0x100000) {
		if ((*p) != 0xA5) return 0;
	}
	if ((*endAddr) != 0x5A) return 0;

	return 1;
}

uint16_t checkTouchPanel(void)
{
	uint8_t chipID = readFT5336ChipID();
	return (chipID == 0x51);
}

void fillRect(
		const uint16_t x,
		const uint16_t y,
		const uint16_t w,
		const uint16_t h,
		const uint32_t color,
		const uint8_t  layer)
{
	uint8_t* pFB = (uint8_t*)((layer == LAYER_BG) ? &frameBuffer1 : &frameBuffer2);
	while (DMA2D->CR & DMA2D_CR_START); // wait previous transfer complete

	DMA2D->CR 		&= ~DMA2D_CR_MODE_Msk;
	DMA2D->CR 		|= 0b11 << DMA2D_CR_MODE_Pos; // register to memory
	DMA2D->OCOLR	= color;
	DMA2D->OMAR		= (uint32_t)(&(pFB[(y * LCD_ACTIVE_WIDTH + x) * LCD_FRAME_BUF_BYTES]));
	DMA2D->OOR		= LCD_ACTIVE_WIDTH - w;
	DMA2D->OPFCCR	= 0b000; // ARGB8888
	DMA2D->NLR		= w << DMA2D_NLR_PL_Pos | h << DMA2D_NLR_NL_Pos;

	DMA2D->CR   	|= DMA2D_CR_START;
}

void drawImage(
		const uint16_t x,
		const uint16_t y,
		const uint16_t w,
		const uint16_t h,
		const uint32_t addr,
		const uint8_t  format,
		const uint8_t  layer)
{
	uint8_t* pFB = (uint8_t*)((layer == LAYER_BG) ? &frameBuffer1 : &frameBuffer2);
	while (DMA2D->CR & DMA2D_CR_START); // wait previous transfer complete

