wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
	DMA2D->CR 		&= ~DMA2D_CR_MODE_Msk;
	DMA2D->CR 		|= 0b01 << DMA2D_CR_MODE_Pos; // FG PFC
	DMA2D->FGMAR	= addr;
	DMA2D->OMAR		= (uint32_t)(&(pFB[(y * LCD_ACTIVE_WIDTH + x) * LCD_FRAME_BUF_BYTES]));
	DMA2D->FGOR		= 0;
	DMA2D->OOR		= LCD_ACTIVE_WIDTH - w;
	DMA2D->FGPFCCR	= format; // fore-ground color type
	DMA2D->OPFCCR	= 0b000;  // ARGB8888
	DMA2D->NLR		= w << DMA2D_NLR_PL_Pos | h << DMA2D_NLR_NL_Pos;

	DMA2D->CR   	|= DMA2D_CR_START;
}

void drawChar(
		const uint16_t x,
		const uint16_t y,
		const uint32_t foreColor,
		const uint32_t backColor,
		const uint16_t symbol,
		const uint8_t  fontType,
		const uint8_t  layer)
{
	uint32_t height = (FONT_SMALL == fontType) ? sFont.st.head.fontHeight    : mFont.st.head.fontHeight;
	uint32_t width  = (FONT_SMALL == fontType) ? sFont.st.cdef[symbol].width : mFont.st.cdef[symbol].width;
	uint8_t* pFB = (uint8_t*)((layer == LAYER_BG) ? &frameBuffer1 : &frameBuffer2);

	while (DMA2D->CR & DMA2D_CR_START); // wait previous transfer complete

	if (FONT_SMALL == fontType) {
		setCharBuf06x08(symbol, foreColor, backColor);
	}
	else {
		setCharBuf12x16(symbol, foreColor, backColor);
	}

	DMA2D->CR 		&= ~DMA2D_CR_MODE_Msk;
	DMA2D->CR 		|= 0b01 << DMA2D_CR_MODE_Pos; // FG PFC
	DMA2D->FGMAR	= (uint32_t)&charBuffer;
	DMA2D->OMAR		= (uint32_t)(&(pFB[(y * LCD_ACTIVE_WIDTH + x) * LCD_FRAME_BUF_BYTES]));
	DMA2D->FGOR		= 0;
	DMA2D->OOR		= LCD_ACTIVE_WIDTH - width;
	DMA2D->FGPFCCR	= 0b0000; // ARGB8888
	DMA2D->OPFCCR	= 0b000;  // ARGB8888
	DMA2D->NLR		= width << DMA2D_NLR_PL_Pos | height << DMA2D_NLR_NL_Pos;

	DMA2D->CR   	|= DMA2D_CR_START;
}

void drawString( // It only can support 1 line string
		const uint16_t x,
		const uint16_t y,
		const uint32_t foreColor,
		const uint32_t backColor,
		const char* const string,
		const uint8_t  fontType,
		const uint8_t  layer)
{
	uint16_t currentX = x;
	char* pString = (char*)string;
	while (*pString != '\0') {
		drawChar(currentX, y, foreColor, backColor, *pString, fontType, LAYER_FG);
		currentX += (FONT_SMALL == fontType) ? sFont.st.cdef[(uint32_t)(*pString)].width : mFont.st.cdef[(uint32_t)(*pString)].width;
		pString++;
	}
}

uint32_t getRandomData(void)
{
	RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
	while((RCC->AHB2ENR & RCC_AHB2ENR_RNGEN_Msk) == 0);

	RNG->CR = RNG_CR_RNGEN;
	while((RNG->SR & RNG_SR_DRDY_Msk) == 0);

	uint32_t random = RNG->DR;

	RCC->AHB2RSTR |= RCC_AHB2RSTR_RNGRST;
	return random;
}

uint32_t checkDMA(uint16_t data)
{
	uint32_t  size = 0x8000;
	uint16_t* pSrc = &data;
	uint16_t* pDes = (uint16_t*)((uint32_t)&_ssdram + (uint32_t)(0x500000/sizeof(uint16_t)));

	RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_DMA2EN_Msk) == 0);

	DMA2_Stream0->CR = 	DMA_SxCR_CHSEL_0 |	// Stream0, channel1
						DMA_SxCR_PSIZE_0 |	// src data 16bits
						DMA_SxCR_MSIZE_0 |	// des data 16bits
						DMA_SxCR_MINC | 	// des address automatic increase
						DMA_SxCR_PL_0 | DMA_SxCR_PL_1 | // highest DMA priority
						DMA_SxCR_DIR_1; 	// memory to memory
	DMA2_Stream0->NDTR = size/sizeof(uint16_t);	 // 32768 / 2 = 16 K half word
	DMA2_Stream0->PAR  = (uint32_t)(pSrc);
	DMA2_Stream0->M0AR = (uint32_t)(pDes);

	DMA2_Stream0->CR |= DMA_SxCR_EN; // start DMA transfer

	while((DMA2->LISR & DMA_LISR_TCIF0_Msk) == 0); // wait transfer complete
	DMA2->LIFCR |= DMA_LIFCR_CTCIF0; // must clear TC interrupt flag for next DMA

	//RCC->AHB1RSTR |= RCC_AHB1RSTR_DMA2RST;

	return (*pDes == data && *(pDes + 0x3FF8) == data);
}

// Internal API function group

// The following initialization process is write for STM32F746G-DISCO
// FPU initialization
static void initFPU(void)
{
	SCB->CPACR |= 	0b11 << 20 | // CP10
					0b11 << 22;  // CP11
	while((SCB->CPACR & (0b1111 << 20)) != (0b1111 << 20));
}

// System clock initialization
static void initSystemClock(void)
{
	// 1. Set HSE and reset RCC_CIR
	RCC->CR |= RCC_CR_HSEBYP | RCC_CR_HSEON;
	while((RCC->CR & RCC_CR_HSERDY_Msk) == 0);
	RCC->CIR = 0x00000000; // disable all RCC interrupts

	// 2. Set FLASH latency
	FLASH->ACR |= FLASH_ACR_LATENCY_7WS; // need be set in 216MHz
	while((FLASH->ACR & FLASH_ACR_LATENCY_Msk) != FLASH_ACR_LATENCY_7WS);
	//FLASH->ACR |= FLASH_ACR_ARTEN | FLASH_ACR_PRFTEN;
	//PWR->CR1 |= 0b11 << PWR_CR1_VOS_Pos; // default value has set to 0b11 in reset

	// 3. Enable PWR clock
	RCC->APB1ENR |= RCC_APB1ENR_PWREN;
	while((RCC->APB1ENR & RCC_APB1ENR_PWREN_Msk) == 0);

	// 4. Activation OverDrive Mode
	PWR->CR1 |= PWR_CR1_ODEN;
	while((PWR->CSR1 & PWR_CSR1_ODRDY_Msk) == 0);

	// 5. Activation OverDrive Switching
	PWR->CR1 |= PWR_CR1_ODSWEN;
	while((PWR->CSR1 & PWR_CSR1_ODSWRDY_Msk) == 0);

	// 6. Main PLL configuration and activation
	RCC->PLLCFGR = PLLM | PLLN | PLLP | PLLSRC | PLLQ;
	RCC->CR |= RCC_CR_PLLON;
	while((RCC->CR & RCC_CR_PLLRDY_Msk) == 0);

	// 7. System clock activation on the main PLL
	RCC->CFGR |=	RCC_CFGR_HPRE_DIV1 |	 // set HPRE  (AHB  pre-scaler) to 1 (216 MHz)
					RCC_CFGR_PPRE1_DIV4 |	 // set PPRE1 (APB1 pre-scaler) to 4 (54  MHz)
					RCC_CFGR_PPRE2_DIV2;	 // set PPRE2 (APB2 pre-scaler) to 2 (108 MHz)
	// Attention : before switching System clock to PLL, it must wait all pre-scale value set to CFGR.
	while((RCC->CFGR & (RCC_CFGR_HPRE_Msk | RCC_CFGR_PPRE1_Msk | RCC_CFGR_PPRE2_Msk)) !=
		(RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV4 | RCC_CFGR_PPRE2_DIV2));
	RCC->CFGR |=	RCC_CFGR_SW_PLL; // switch main clock to PLL
	while((RCC->CFGR & RCC_CFGR_SWS_Msk) != RCC_CFGR_SWS_PLL);
}

// SDRAM initialization
static void initSDRAM(void)
{
	uint32_t reg, mask;

	// Initialize GPIO for FMC
	initSDRAMGPIO();

	// Enable FMC RCC
	RCC->AHB3ENR	|=	RCC_AHB3ENR_FMCEN;
	while((RCC->AHB3ENR & RCC_AHB3ENR_FMCEN_Msk) == 0);

	// The following comment is copied from STM32F746G data-sheet FMC-SDRAM chapter.
	// --- Set MCU-FMC register ---
	// 1. Program the memory device features into the FMC_SDCRx register.
	//    The SDRAM clock frequency, RBURST and RPIPE must be programmed in
	//    the FMC_SDCR1 register.
	mask =	FMC_SDCR1_NC_Msk |
			FMC_SDCR1_NR_Msk |
			FMC_SDCR1_MWID_Msk |
			FMC_SDCR1_NB_Msk |
			FMC_SDCR1_CAS_Msk |
			FMC_SDCR1_WP_Msk |
			FMC_SDCR1_SDCLK_Msk |
			FMC_SDCR1_RBURST_Msk |
			FMC_SDCR1_RPIPE_Msk;
	reg  = 	0b00 << FMC_SDCR1_NC_Pos |		// 8 bits
			0b01 << FMC_SDCR1_NR_Pos |		// 12 bits
			0b01 << FMC_SDCR1_MWID_Pos |	// 16 bits
			0b1  << FMC_SDCR1_NB_Pos |		// 4 banks
			0b11 << FMC_SDCR1_CAS_Pos |		// 3 cycles
			0b0  << FMC_SDCR1_WP_Pos |		// enable write operation
			0b10 << FMC_SDCR1_SDCLK_Pos |	// HCLK x 2 = 108MHz = 9.26ns
			0b1  << FMC_SDCR1_RBURST_Pos |	// enable burst mode
			0b00 << FMC_SDCR1_RPIPE_Pos;	// 0 latency after CAS
	FMC_Bank5_6->SDCR[0] &= ~mask;
	FMC_Bank5_6->SDCR[0] |= reg;
	while((FMC_Bank5_6->SDCR[0] & mask) != reg);

