wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
	// 2. Program the memory device timing into the FMC_SDTRx register.
	//    The TRP and TRC timings must be programmed in the FMC_SDTR1 register.
	mask =	FMC_SDTR1_TMRD_Msk |
			FMC_SDTR1_TXSR_Msk |
			FMC_SDTR1_TRAS_Msk |
			FMC_SDTR1_TRC_Msk |
			FMC_SDTR1_TWR_Msk |
			FMC_SDTR1_TRP_Msk |
			FMC_SDTR1_TRCD_Msk;
	reg  = 	1 << FMC_SDTR1_TMRD_Pos |	// 1 cycle : uncertain !
			8 << FMC_SDTR1_TXSR_Pos |	// 8 x 9.26 = 74.08ns > tXSR(70ns)
			3 << FMC_SDTR1_TRAS_Pos |	// 3 x 9.26 = 27.78ns < tRFC(70ns) : uncertain !
			8 << FMC_SDTR1_TRC_Pos |	// 8 x 9.26 = 74.08ns > tRC(70ns)
			3 << FMC_SDTR1_TWR_Pos |	// 3 x 9.26 = 27.78ns > tWR(1CLK+7ns or 14ns) : uncertain !
			3 << FMC_SDTR1_TRP_Pos |	// 3 x 9.26 = 27.78ns > tRP(20ns)
			3 << FMC_SDTR1_TRCD_Pos;	// 3 x 9.26 = 27.78ns < tRCD(20ns)
	FMC_Bank5_6->SDTR[0] &= ~mask;
	FMC_Bank5_6->SDTR[0] |= reg;
	while((FMC_Bank5_6->SDTR[0] & mask) != reg);

	// --- Set SDRAM-MODE register ---
	// 3. Set MODE bits to ‘001’ and configure the Target Bank bits
	//    (CTB1 and/or CTB2) in the	FMC_SDCMR register to start delivering
	//    the clock to the memory (SDCKE is driven high).
	mask =	FMC_SDCMR_MODE_Msk |
			FMC_SDCMR_CTB1_Msk |
			FMC_SDCMR_NRFS_Msk |
			FMC_SDCMR_MRD_Msk;
	reg  = 	0b001	<< FMC_SDCMR_MODE_Pos |	// clock assign enable
			0b1		<< FMC_SDCMR_CTB1_Pos |	// CTB1 enable
			0		<< FMC_SDCMR_NRFS_Pos |	// NRFS not use
			0		<< FMC_SDCMR_MRD_Pos;	// MRD not use
	FMC_Bank5_6->SDCMR &= ~mask;
	FMC_Bank5_6->SDCMR |= reg;

	// 4. Wait during the prescribed delay period. Typical delay is around
	//    100 us (refer to the SDRAM data-sheet for the required delay after power-up).
	for (volatile uint32_t i = 0; i < 50000; i++); // at least 100 us delay here, (216MHz = 4.63ns, 100us / 2.63ns = 21598)

	// 5. Set MODE bits to ‘010’ and configure the Target Bank bits
	//    (CTB1 and/or CTB2) in the FMC_SDCMR register to issue a “Pre-charge All” command.
	reg  = 	0b010	<< FMC_SDCMR_MODE_Pos |	// pre-charge all
			0b1		<< FMC_SDCMR_CTB1_Pos |	// CTB1 enable
			0		<< FMC_SDCMR_NRFS_Pos |	// NRFS not use
			0		<< FMC_SDCMR_MRD_Pos;	// MRD not use
	FMC_Bank5_6->SDCMR &= ~mask;
	FMC_Bank5_6->SDCMR |= reg;

	// 6. Set MODE bits to ‘011’, and configure the Target Bank bits
	//    (CTB1 and/or CTB2) as well as the number of consecutive Auto-refresh
	//    commands (NRFS) in the FMC_SDCMR register.
	//    Refer to the SDRAM data-sheet for the number of Auto-refresh commands
	//    that should be issued. Typical number is 8.
	reg  = 	0b011	<< FMC_SDCMR_MODE_Pos |	// clock assign enable
			0b1		<< FMC_SDCMR_CTB1_Pos |	// CTB1 enable
			8		<< FMC_SDCMR_NRFS_Pos |	// Typical number is 8, but according to following MT48LC4M32B manual it's at least 2 and must delay 100us between twice auto-refresh command.
			0		<< FMC_SDCMR_MRD_Pos;	// MRD not use
	FMC_Bank5_6->SDCMR &= ~mask;
	FMC_Bank5_6->SDCMR |= reg;

	// 7. Configure the MRD field according to the SDRAM device, set the MODE bits
	//    to '100', and configure the Target Bank bits (CTB1 and/or CTB2) in
	//    the FMC_SDCMR register to issue a "Load Mode Register" command in order to
	//    program the SDRAM device. In particular:
	//    a) the CAS latency must be selected following configured value in
	//       FMC_SDCR1/2 registers
	//    b) the Burst Length (BL) of 1 must be selected by configuring the
	//       M[2:0] bits to 000 in the mode register. Refer to SDRAM device data-sheet.
	//    If the Mode Register is not the same for both SDRAM banks,
	//    this step has to be repeated twice, once for each bank,
	//    and the Target Bank bits set accordingly.

	// The mode register of MT48LC4M32B can refer to following definition.
	//  -|---------------|----|---------|--------------|----|--------------|-
	//   | 12 | 11 | 10  |  9 |  8 |  7 |  6 |  5 |  4 |  3 |  2 |  1 |  0 |
	//  -|---------------|----|---------|--------------|----|--------------|-
	//   |  Reserved     | WB | Op Mode | CAS Latency  | BT | Burst Length |
	//  -|---------------|----|---------|--------------|----|--------------|-
	uint16_t MODEREG =	0b000	<< 0 |		// length = 1
						0b1		<< 3 |		// interleaved
						0b011	<< 4 |		// latency = 3
						0b00	<< 7 |		// standard
						0b1		<< 9;		// single
	reg  = 	0b100	<< FMC_SDCMR_MODE_Pos |	// load mode register
			0b1		<< FMC_SDCMR_CTB1_Pos |	// CTB1 enable
			0		<< FMC_SDCMR_NRFS_Pos |	// not use
			MODEREG	<< FMC_SDCMR_MRD_Pos;	// Mode register
	FMC_Bank5_6->SDCMR &= ~mask;
	FMC_Bank5_6->SDCMR |= reg;

	// --- Set MCU-FMC register ---
	// 8. Program the refresh rate in the FMC_SDRTR register
	//    The refresh rate corresponds to the delay between refresh cycles.
	//    Its value must be adapted to SDRAM devices.
	FMC_Bank5_6->SDRTR &= ~FMC_SDRTR_COUNT_Msk;
	FMC_Bank5_6->SDRTR |= (uint32_t)1600 << FMC_SDRTR_COUNT_Pos;

	// The above parameter can be optimized according to the recommendation in SDRAM technical manual below.
	/*
	 * The following description is copied from MT48LC4M32B data-sheet.
	 * The recommended power-up sequence for SDRAM:
	 * 1.  Simultaneously apply power to VDD and VDDQ.
	 * 2.  Assert and hold CKE at a LVTTL logic LOW since all inputs and outputs are
	 *     LVTTL compatible.
	 * 3.  Provide stable CLOCK signal. Stable clock is defined as a signal cycling
	 *     within timing constraints specified for the clock pin.
	 * 4.  Wait at least 100˩s prior to issuing any command other than a
	 *     COMMAND INHIBIT or NOP.
	 * 5.  Starting at some point during this 100us period, bring CKE HIGH.
	 *     Continuing at least through the end of this period, 1 or more
	 *     COMMAND INHIBIT or NOP commands must be applied.
	 * 6.  Perform a PRECHARGE ALL command.
	 * 7.  Wait at least tRP time; during this time NOPs or DESELECT commands must
	 *     be given. All banks will complete their pre-charge, thereby placing
	 *     the device in the all banks idle state.
	 * 8.  Issue an AUTO REFRESH command.
	 * 9.  Wait at least tRFC time, during which only NOPs or COMMAND INHIBIT
	 *     commands are allowed.
	 * 10. Issue an AUTO REFRESH command.
	 * 11. Wait at least tRFC time, during which only NOPs or COMMAND INHIBIT
	 *     commands are allowed.
	 * 12. The SDRAM is now ready for mode register programming. Because the mode
	 *     register will power up in an unknown state, it should be loaded with
	 *     desired bit values prior to applying any operational command.
	 *     Using the LMR command, program the mode register.
	 *     The mode register is programmed via the MODE REGISTER SET command
	 *     with BA1 = 0, BA0 = 0 and retains the stored information until it is
	 *     programmed again or the device loses power.
	 *     Not programming the mode register upon initialization will result in
	 *     default settings which may not be desired. Outputs are guaranteed High-Z
	 *     after the LMR command is issued. Outputs should be High-Z already
	 *     before the LMR command is issued.
	 * 13. Wait at least tMRD time, during which only NOP or DESELECT commands
	 *     are allowed.
	 * At this point the DRAM is ready for any valid command.
	 *
	 */
}

