wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
// System tick initialization
static void initSystick(void)
{
	// Set RELOAD value (216000000 / 1000 = 216000)
	SysTick->LOAD = 0x00034BC0 - 1;

	// Set current value by default value
	//SysTick->VAL = 0x00000000;

	// Set CLKSOURCE, ENABLE
	SysTick->CTRL |= 	0b1 << SysTick_CTRL_CLKSOURCE_Pos |	// clk-source : processor clock
						0b1 << SysTick_CTRL_ENABLE_Pos;		// enable systick counter
}

// USART1 initialization
static void initUSART1(void)
{
	// Initialize USART1 TX/RX pin
	initUartGPIO();

	// Enable APB2 USART1 RCC
	RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
	while((RCC->APB2ENR & RCC_APB2ENR_USART1EN_Msk) == 0);

	// Set USART1 parameter
	//USART1->BRR = 0x2BF2;	// baud rate = 9600(fCK=108MHz, CR1/OVER8=0, 0x2BF2 = 108000000/9600)
	USART1->BRR = 0x03AA;	// baud rate = 15200(fCK=108MHz, CR1/OVER8=0, 0x03AA = 108000000/115200)
	USART1->CR1 &= ~USART_CR1_M;	// data bits = 8(M[1:0]=00)
	USART1->CR2 &= ~USART_CR2_STOP;	// stop bits = 1(STOP[1:0]=00)
	USART1->CR1 &= ~USART_CR1_PCE;	// parity = off(parity = on, odd:0x00000600, even:0x00000400)
	USART1->CR3 &= ~(USART_CR3_CTSE | USART_CR3_RTSE); // disable CTS and RTS

	// Disable RX interrupt in console log mode
	//USART1->CR1 |&= USART_CR1_RXNEIE;

	// Enable USART1
	USART1->CR1 |= USART_CR1_UE;

	// Enable TX and RE
	USART1->CR1 |= USART_CR1_TE | USART_CR1_RE;
}

// Touch panel initialization (I2C3 and EXIT13)
static void initTouchPanel(void)
{
	// ---- Initialize I2C3 ----
	// Initialize GPIO for I2C3
	initTouchPanelGPIO();

	// Enable I2C3 RCC
	RCC->APB1ENR	|=	RCC_APB1ENR_I2C3EN;
	while((RCC->APB1ENR & RCC_APB1ENR_I2C3EN_Msk) == 0);

	// Set I2C3 clock
	RCC->DCKCFGR2	&=	~RCC_DCKCFGR2_I2C3SEL_Msk;
	RCC->DCKCFGR2	|=	0b00 << RCC_DCKCFGR2_I2C3SEL_Pos; // APB1 clock (54MHz)

	// Set I2C3 register
	I2C3->CR1		&=	~I2C_CR1_PE_Msk;
	I2C3->TIMINGR	=	0x30C03444; // calculate by CubeMX (I2C Frequency = 100KHz, Rise time = 700ns, Fall time = 100ns)
	//I2C3->TIMINGR	=	0x40912732; // from ST sample
	//I2C3->TIMINGR	=	0x20404768; // from https://github.com/haidongqing/i2c3test-xy/blob/master/
	I2C3->OAR1		&=	~(I2C_OAR1_OA1_Msk | I2C_OAR1_OA1MODE_Msk | I2C_OAR1_OA1EN_Msk);
	I2C3->OAR1		|=	0b1 << I2C_OAR1_OA1EN_Pos;

	// Reset I2C3
	while(I2C3->CR1 & I2C_CR1_PE_Msk);
	I2C3->CR1		|=	I2C_CR1_PE;

	// ---- Initialize EXTI13 ----
	// Mapping PI13 in SYSCFG register
	RCC->APB2ENR	|=	RCC_APB2ENR_SYSCFGEN;
	while((RCC->APB2ENR & RCC_APB2ENR_SYSCFGEN) == 0);
	SYSCFG->EXTICR[3] &= ~SYSCFG_EXTICR4_EXTI13_Msk;
	SYSCFG->EXTICR[3] |= SYSCFG_EXTICR4_EXTI13_PI;

	// Initialize EXTI15_10 interrupt
	EXTI->IMR		|=	EXTI_IMR_MR13;  // EXT INT 13
	EXTI->RTSR		|=	EXTI_RTSR_TR13; // Rising edge trigger

	// Enable FT5336 interrupt to host
	enableFT5336Int();
	//printf("GMODE = %d.\r\n", (int)i2c3Read1Byte(0x70, 0xA4));
}

// LTDC initialization
static void initLCD(void)
{
	// Initialize GPIO for LTDC
	initLCDGPIO();

	// Initialize DMA2D
	initDMA2D();

	// 1. Enable the LTDC clock in the RCC register.
	RCC->APB2ENR	|=	RCC_APB2ENR_LTDCEN;
	while((RCC->APB2ENR & RCC_APB2ENR_LTDCEN_Msk) == 0);

	// 2. Configure the required pixel clock following the panel datasheet.
	RCC->DCKCFGR1	&=	~RCC_DCKCFGR1_PLLSAIDIVR_Msk;
	RCC->DCKCFGR1	|=	0b10 << RCC_DCKCFGR1_PLLSAIDIVR_Pos; // PLLSAIDIVR = 8
	RCC->PLLSAICFGR = 	384 << RCC_PLLSAICFGR_PLLSAIN_Pos |
						5 << RCC_PLLSAICFGR_PLLSAIR_Pos |
						2 << RCC_PLLSAICFGR_PLLSAIQ_Pos | // not used
						0 << RCC_PLLSAICFGR_PLLSAIP_Pos;  // not used
	RCC->CR |= RCC_CR_PLLSAION;
	while((RCC->CR & RCC_CR_PLLSAIRDY_Msk) == 0);

	//  The following graph is copied from ST sample code.
	//  LCD_TFT synchronous timings configuration :
	//  -------------------------------------------
	//
	//                                             Total Width
	//                          <--------------------------------------------------->
	//                    Hsync width HBP             Active Width                HFP
	//                          <---><--><--------------------------------------><-->
	//                      ____    ____|_______________________________________|____
	//                          |___|   |                                       |    |
	//                                  |                                       |    |
	//                      __|         |                                       |    |
	//         /|\    /|\  |            |                                       |    |
	//          | VSYNC|   |            |                                       |    |
	//          |Width\|/  |__          |                                       |    |
	//          |     /|\     |         |                                       |    |
	//          |  VBP |      |         |                                       |    |
	//          |     \|/_____|_________|_______________________________________|    |
	//          |     /|\     |         | / / / / / / / / / / / / / / / / / / / |    |
	//          |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	// Total    |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	// Heigh    |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	//          |Active|      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	//          |Heigh |      |         |/ / / / / / Active Display Area / / / /|    |
	//          |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	//          |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	//          |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	//          |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	//          |      |      |         |/ / / / / / / / / / / / / / / / / / / /|    |
	//          |     \|/_____|_________|_______________________________________|    |
	//          |     /|\     |                                                      |
	//          |  VFP |      |                                                      |
	//         \|/    \|/_____|______________________________________________________|
	//
	//
	//  Each LCD device has its specific synchronous timings values.
	//  This example uses AM480272H3TMQW-T01H LCD (MB1046 B-01) and configures
	//  the synchronous timings as following :
	//
	//  ********************************** !!!! Attention !!!! **********************************
	//  ST sample code is written for AM480272H3TMQW-T01H LCD (MB1046 B-01). It just can support RGB565
	//  (16 bits/pixel). But my board is MB1191 B-02, and it's LCD RK043FN48H-CT672B can support RGB888
	//  (24 bits/pixel). In order to improve the quality of LCD display, the layer register PFCR and CFBLR
	//  setting value should be modified.
	//  *****************************************************************************************
	//
	//  Horizontal Synchronization (Hsync) = 41
	//  Horizontal Back Porch (HBP)        = 13
	//  Active Width                       = 480
	//  Horizontal Front Porch (HFP)       = 32
	//
	//  Vertical Synchronization (Vsync)   = 10
	//  Vertical Back Porch (VBP)          = 2
	//  Active Height                      = 272
	//  Vertical Front Porch (VFP)         = 2
	//

	// 3. Configure the synchronous timings: VSYNC, HSYNC, vertical and horizontal back
	//    porch, active data area and the front porch timings following the panel datasheet as
	//    described in the Section 18.4.1: LTDC global configuration parameters.
	LTDC->SSCR	= 	(LCD_HSYNC - 1)											<< LTDC_SSCR_HSW_Pos |
					(LCD_VSYNC - 1)											<< LTDC_SSCR_VSH_Pos;
	LTDC->BPCR	=	(LCD_HSYNC + LCD_HBP - 1)								<< LTDC_BPCR_AHBP_Pos |
					(LCD_VSYNC + LCD_VBP - 1) 								<< LTDC_BPCR_AVBP_Pos;
	LTDC->AWCR	=	(LCD_HSYNC + LCD_HBP + LCD_ACTIVE_WIDTH - 1) 			<< LTDC_AWCR_AAW_Pos |
					(LCD_VSYNC + LCD_VBP + LCD_ACTIVE_HEIGHT - 1) 			<< LTDC_AWCR_AAH_Pos;
	LTDC->TWCR	=	(LCD_HSYNC + LCD_HBP + LCD_ACTIVE_WIDTH + LCD_HFP - 1) 	<< LTDC_TWCR_TOTALW_Pos |
					(LCD_VSYNC + LCD_VBP + LCD_ACTIVE_HEIGHT + LCD_VFP - 1) << LTDC_TWCR_TOTALH_Pos;
	// while();

	// 4. Configure the synchronous signals and clock polarity in the LTDC_GCR register.
	// (*) Polarity assignment set by default value (low level valid).

	// 5. If needed, configure the background color in the LTDC_BCCR register.
	// (*) Background color set by default value (RGB888:0x000000).

	// 6. Configure the needed interrupts in the LTDC_IER and LTDC_LIPCR register.
	// (*) Temporarily donn't enable LTDC interrupt.

	// 7. Configure the layer1/2 parameters by:
	// ---- for layer1 ----
	//    – programming the layer window horizontal and vertical position in the
	//      LTDC_LxWHPCR and LTDC_WVPCR registers. The layer window must be in the
	//      active data area.
	uint16_t bpcrAhbp1	=	((LTDC->BPCR & LTDC_BPCR_AHBP_Msk) >> LTDC_BPCR_AHBP_Pos) + 1;
	uint16_t bpcrAvbp1	=	((LTDC->BPCR & LTDC_BPCR_AVBP_Msk) >> LTDC_BPCR_AVBP_Pos) + 1;
	LTDC_Layer1->WHPCR	=	(0 + bpcrAhbp1) << LTDC_LxWHPCR_WHSTPOS_Pos |
							(LCD_ACTIVE_WIDTH + bpcrAhbp1 - 1)   << LTDC_LxWHPCR_WHSPPOS_Pos;
	LTDC_Layer1->WVPCR	=	(0 + bpcrAvbp1 + 1) << LTDC_LxWVPCR_WVSTPOS_Pos |
							(LCD_ACTIVE_HEIGHT + bpcrAvbp1)   << LTDC_LxWVPCR_WVSPPOS_Pos;

	//    – programming the pixel input format in the LTDC_LxPFCR register
	LTDC_Layer1->PFCR	=	0b000; // ARGB8888

