wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
	//    – programming the color frame buffer start address in the LTDC_LxCFBAR register
	LTDC_Layer1->CFBAR	=	(uint32_t)&frameBuffer1; // Frame Buffer

	//    – programming the line length and pitch of the color frame buffer in the
	//      LTDC_LxCFBLR register
	LTDC_Layer1->CFBLR	=	(LCD_ACTIVE_WIDTH * LCD_FRAME_BUF_BYTES) << LTDC_LxCFBLR_CFBP_Pos |
							(LCD_ACTIVE_WIDTH * LCD_FRAME_BUF_BYTES + 3) << LTDC_LxCFBLR_CFBLL_Pos;

	//    – programming the number of lines of the color frame buffer in the
	//      LTDC_LxCFBLNR register
	LTDC_Layer1->CFBLNR	=	LCD_ACTIVE_HEIGHT;

	//    – if needed, loading the CLUT with the RGB values and its address in the
	//      LTDC_LxCLUTWR register
	// (*) Temporarily needn't CLUT function.

	//    – If needed, configuring the default color and the blending factors respectively in the
	//      LTDC_LxDCCR and LTDC_LxBFCR registers
	// (*) Default color and the blending factors respectively set by default value
	// (*) (constant alpha = 255, pixel alpha = 0, blending factor 1/2 = constant alpha * pixel alpha)

	// ---- for layer2 ----
	//    – programming the layer window horizontal and vertical position in the
	//      LTDC_LxWHPCR and LTDC_WVPCR registers. The layer window must be in the
	//      active data area.
	uint16_t bpcrAhbp2	=	((LTDC->BPCR & LTDC_BPCR_AHBP_Msk) >> LTDC_BPCR_AHBP_Pos) + 1;
	uint16_t bpcrAvbp2	=	((LTDC->BPCR & LTDC_BPCR_AVBP_Msk) >> LTDC_BPCR_AVBP_Pos) + 1;
	LTDC_Layer2->WHPCR	=	(0 + bpcrAhbp2) << LTDC_LxWHPCR_WHSTPOS_Pos |
							(LCD_ACTIVE_WIDTH + bpcrAhbp2 - 1)   << LTDC_LxWHPCR_WHSPPOS_Pos;
	LTDC_Layer2->WVPCR	=	(0 + bpcrAvbp2 + 1) << LTDC_LxWVPCR_WVSTPOS_Pos |
							(LCD_ACTIVE_HEIGHT + bpcrAvbp2)   << LTDC_LxWVPCR_WVSPPOS_Pos;

	//    – programming the pixel input format in the LTDC_LxPFCR register
	LTDC_Layer2->PFCR	=	0b000; // ARGB8888

	//    – programming the color frame buffer start address in the LTDC_LxCFBAR register
	LTDC_Layer2->CFBAR	=	(uint32_t)&frameBuffer2; // Frame Buffer

	//    – programming the line length and pitch of the color frame buffer in the
	//      LTDC_LxCFBLR register
	LTDC_Layer2->CFBLR	=	(LCD_ACTIVE_WIDTH * LCD_FRAME_BUF_BYTES) << LTDC_LxCFBLR_CFBP_Pos |
							(LCD_ACTIVE_WIDTH * LCD_FRAME_BUF_BYTES + 3) << LTDC_LxCFBLR_CFBLL_Pos;

	//    – programming the number of lines of the color frame buffer in the
	//      LTDC_LxCFBLNR register
	LTDC_Layer2->CFBLNR	=	LCD_ACTIVE_HEIGHT;

	//    – if needed, loading the CLUT with the RGB values and its address in the
	//      LTDC_LxCLUTWR register
	// (*) Temporarily needn't CLUT function.

	//    – If needed, configuring the default color and the blending factors respectively in the
	//      LTDC_LxDCCR and LTDC_LxBFCR registers
	// (*) Default color and the blending factors respectively set by default value
	// (*) (constant alpha = 255, pixel alpha = 0, blending factor 1/2 = constant alpha * pixel alpha)

	// 8. Enable layer1/2 and if needed the CLUT in the LTDC_LxCR register.
	LTDC_Layer1->CR |= LTDC_LxCR_LEN;
	LTDC_Layer2->CR |= LTDC_LxCR_LEN;

	// 9. If needed, enable dithering and color keying respectively in the LTDC_GCR and
	//    LTDC_LxCKCR registers. They can be also enabled on the fly.
	// (*) It need not dithering and color keying respectively function.

	// 10. Reload the shadow registers to active register through the LTDC_SRCR register.
	LTDC->SRCR |= LTDC_SRCR_IMR;

	// 11. Enable the LCD-TFT controller in the LTDC_GCR register.
	LTDC->GCR |= LTDC_GCR_LTDCEN;

	// 12. All layer parameters can be modified on the fly except the CLUT. The new configuration
	//    has to be either reloaded immediately or during vertical blanking period by configuring
	//    the LTDC_SRCR register.
}

static void initDMA2D(void)
{
	RCC->AHB1ENR	|= RCC_AHB1ENR_DMA2DEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_DMA2DEN_Msk) == 0);
}

static void initLED1(void)
{
	initLED1GPIO();
}

static uint8_t initSDCard(void)
{
	uint32_t resp  = 0;
	uint32_t volt  = 0;
	uint32_t count = 0xFFFF;

	if (!isSDCardInsert()) return 0;

	// Initialize SDMMC interface to initialize mode (400KHz, 1bit)
	SDMMC1->CLKCR	=	0x76 << SDMMC_CLKCR_CLKDIV_Pos |	// 0x76+2=120, 48MHz/120=400KHz
						0b0 << SDMMC_CLKCR_HWFC_EN_Pos |	// disable hardware flow control
						0b00 << SDMMC_CLKCR_WIDBUS_Pos |	// 1 bit mode SDMMC_D0
						0b0  << SDMMC_CLKCR_PWRSAV_Pos |	// enable SDMMC_CK in SD bus inactive
						0b0  << SDMMC_CLKCR_BYPASS_Pos |	// disable bypass CLKDIV
						0b0 << SDMMC_CLKCR_NEGEDGE_Pos |	// rising edge R/W
						0b0 << SDMMC_CLKCR_CLKEN_Pos;		// disable SDMMC clock

	// Power on
	SDMMC1->POWER	=	SDMMC_POWER_PWRCTRL;				// power on
	for (volatile uint32_t i = 0; i < 1000000; i++);		// delay > 1ms
	SDMMC1->CLKCR	|=	0b1 << SDMMC_CLKCR_CLKEN_Pos;		// enable SDMMC clock

	// Send CMD0 to identify card operating voltage.
	sdmmcSendCmd(SD_CMD_GO_IDLE_STATE, 0);
	if (!sdmmcCheckCmdError()) return 0;

	// Send CMD8 to verify SD card version.
	// [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
	// [7:0]:  Check Pattern (recommended 0xAA) */
	sdmmcSendCmd(SD_CMD_HS_SEND_EXT_CSD, 0x1AA);
	if (sdmmcCheckCmdResp7()) {
		sdcard.version = SD_VERSION_2X;
	}
	else {
		sdcard.version = SD_VERSION_1X;
	}

	// Wait for SD card ready.
	do {
		// Send CMD55 to change command mode to application command.
		sdmmcSendCmd(SD_CMD_APP_CMD, 0);
		if (!sdmmcCheckCmdResp1(SD_CMD_APP_CMD)) return 0;

		// Send CMD41 to judge if SD card is ready.
		// SDMMC_VOLTAGE_WINDOW_SD	: 0x80100000
		// SDMMC_HIGH_CAPACITY		: 0x40000000
		// SD_SWITCH_1_8V_CAPACITY	: 0x01000000
		sdmmcSendCmd(SD_CMD_SD_APP_OP_COND, 0xC1100000);
		if (!sdmmcCheckCmdResp3()) return 0;

		// Get operating voltage
		resp = SDMMC1->RESP1;
		volt = (((resp >> 31) == 1) ? 1 : 0);
		count--;
	}
	while (volt == 0 && count != 0);
	if (count == 0) return 0;
	if (resp & 0x40000000) {
		sdcard.type = SD_TYPE_SDHC_SDXC;
	}
	else {
		sdcard.type = SD_TYPE_SDSC;
	}

	// Send CMD2 to get CID.
	sdmmcSendCmd(SD_CMD_ALL_SEND_CID, 0);
	if (!sdmmcCheckCmdResp2()) return 0;
	sdcard.cid[0] = SDMMC1->RESP1;
	sdcard.cid[1] = SDMMC1->RESP2;
	sdcard.cid[2] = SDMMC1->RESP3;
	sdcard.cid[3] = SDMMC1->RESP4;

	// Send CMD3 to assign SD relative card address.
	sdmmcSendCmd(SD_CMD_SET_REL_ADDR, 0);
	if (!sdmmcCheckCmdResp6(SD_CMD_SET_REL_ADDR, &(sdcard.rca))) return 0;

	return 1;
}

static void initSDMMC(void)
{
	// Set GPIO
	initSDMMCGPIO();

	// Enable RRC
	RCC->APB2ENR	|=	RCC_APB2ENR_SDMMC1EN;
	while((RCC->APB2ENR & RCC_APB2ENR_SDMMC1EN_Msk) == 0);

