wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
	RCC->AHB1ENR	|=	RCC_AHB1ENR_DMA2EN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_DMA2EN_Msk) == 0);

	// Set SDMMC clock
	RCC->DCKCFGR2	&=	~RCC_DCKCFGR2_CK48MSEL_Msk;
	RCC->DCKCFGR2	|=	0b0 << RCC_DCKCFGR2_CK48MSEL_Pos;	// 48MHz from PLLQ
	RCC->DCKCFGR2	&=	~RCC_DCKCFGR2_SDMMC1SEL_Msk;
	RCC->DCKCFGR2	|=	0b0 << RCC_DCKCFGR2_SDMMC1SEL_Pos;	// select 48MHz for SDMMC

	// Configure DMA RX
	DMA2_Stream3->CR &= ~DMA_SxCR_EN;
	DMA2_Stream3->CR = 	0b100	<< DMA_SxCR_CHSEL_Pos |		// stream3, channel4
						0b00	<< DMA_SxCR_DIR_Pos |		// peripheral to memory
						0b0		<< DMA_SxCR_PINC_Pos |		// peripheral increment disable
						0b1		<< DMA_SxCR_MINC_Pos |		// memory increment enable
						0b10	<< DMA_SxCR_PSIZE_Pos |		// peripheral data size = word
						0b10	<< DMA_SxCR_MSIZE_Pos |		// memory data size = word
						0b1		<< DMA_SxCR_PFCTRL_Pos |	// PFC (peripheral is flow controller)
						0b11	<< DMA_SxCR_PL_Pos |		// highest DMA priority
						0b01	<< DMA_SxCR_PBURST_Pos |	// peripheral burst = 4 bytes
						0b01	<< DMA_SxCR_MBURST_Pos;		// peripheral burst = 4 bytes

	DMA2_Stream3->FCR = 0b1		<< DMA_SxFCR_DMDIS_Pos |	// disable direct mode
						0b11	<< DMA_SxFCR_FTH_Pos;		// FIFO full

	DMA2->LIFCR		|= 	DMA_LIFCR_CTCIF3_Msk |
						DMA_LIFCR_CHTIF3_Msk |
						DMA_LIFCR_CTEIF3_Msk |
						DMA_LIFCR_CDMEIF3_Msk |
						DMA_LIFCR_CFEIF3_Msk;
	/*
	DMA2_Stream3->NDTR = size/sizeof(uint16_t);	 // 32768 / 2 = 16 K half word
	DMA2_Stream3->PAR  = (uint32_t)(pSrc);
	DMA2_Stream3->M0AR = (uint32_t)(pDes);
	*/

	// Configure DMA TX
	DMA2_Stream6->CR &= ~DMA_SxCR_EN;
	DMA2_Stream6->CR = 	0b100	<< DMA_SxCR_CHSEL_Pos |		// stream6, channel4
						0b01	<< DMA_SxCR_DIR_Pos |		// memory to peripheral
						0b0		<< DMA_SxCR_PINC_Pos |		// peripheral increment disable
						0b1		<< DMA_SxCR_MINC_Pos |		// memory increment enable
						0b10	<< DMA_SxCR_PSIZE_Pos |		// peripheral data size = word
						0b10	<< DMA_SxCR_MSIZE_Pos |		// memory data size = word
						0b1		<< DMA_SxCR_PFCTRL_Pos |	// PFC (peripheral is flow controller)
						0b11	<< DMA_SxCR_PL_Pos |		// highest DMA priority
						0b01	<< DMA_SxCR_PBURST_Pos |	// peripheral burst = 4 bytes
						0b01	<< DMA_SxCR_MBURST_Pos;		// peripheral burst = 4 bytes

	DMA2_Stream6->FCR = 0b1		<< DMA_SxFCR_DMDIS_Pos |	// disable direct mode
						0b11	<< DMA_SxFCR_FTH_Pos;		// FIFO full

	DMA2->HIFCR		|=	DMA_HIFCR_CTCIF6_Msk |
						DMA_HIFCR_CHTIF6_Msk |
						DMA_HIFCR_CTEIF6_Msk |
						DMA_HIFCR_CDMEIF6_Msk |
						DMA_HIFCR_CFEIF6_Msk;
	/*
	DMA2_Stream6->NDTR = size/sizeof(uint16_t);	 // 32768 / 2 = 16 K half word
	DMA2_Stream6->PAR  = (uint32_t)(pSrc);
	DMA2_Stream6->M0AR = (uint32_t)(pDes);
	*/
}

#ifdef MODE_STAND_ALONE
static void initTIM7(void) // TIM7 initialization for low speed timer(500ms)
{
	// Enable APB1 TIM7 RCC
	RCC->APB1ENR	|= RCC_APB1ENR_TIM7EN;
	while((RCC->APB1ENR & RCC_APB1ENR_TIM7EN_Msk) == 0);

	// Enable TIM7 update interrupt
	TIM7->DIER		|= TIM_DIER_UIE;

	// Initialize TIM7
	TIM7->CR1		|= TIM_CR1_ARPE;		// Enable pre-load ARPE
	TIM7->PSC		= 4000 - 1;				// timer frequency = 108MHz / 4000 = 27KHz (APB pre-sacle is not 1, so fCK_PSC = 54MHz * 2 = 108MHz)
	TIM7->CNT		&= TIM_CNT_UIFCPY_Msk;	// set bit[30:0] to 0
	TIM7->SR		&= ~TIM_SR_UIF;			// Clear timer update interrupt flag
	TIM7->ARR		= 13500 - 1;			// Set 13500 to reload value
	TIM7->CR1		|= TIM_CR1_CEN;			// Enable TIM7 CEN
}
#endif

// Set global NVIC priority
static void initNVICPriority(void)
{
	// STM32F756XX-PM can not refer here, because ST has own design in interrupt priority.
	// ST interrupt priority group setting can refer to the following.
	//   IPR just use the higher 4 bit indicating priority, the lower 4 bit should be set to 0.
	//   The assignment of AIRCR-PRIGROUP can be refer to the following rule.
	//   ----------------|------------------------------------------------
	//                   |                  IPRn / SHPRn
	//    AIRCR-PRIGROUP |------------------------------------------------
	//                   |  preemption priority  |    sub-priority
	//   ----------------|------------------------------------------------
	//     0xb011 :      |  [7:4], 16 level      |    None , None
	//     0xb100 :      |  [7:5], 8 level       |    [4]  , 2 level
	//     0xb011 :      |  [7:6], 4 level       |    [5:4], 4 level
	//     0xb011 :      |  [7]  , 2 level       |    [6:4], 8 level
	//     0xb011 :      |  None , None          |    [7:4], 16 level
	//   ----------------|------------------------------------------------

	// Set global NVIC priority group
	// "|=" can not be used here, because VECTKEY write key is "0x05FA" and "|=" will change it
	SCB->AIRCR =	0x05FA << SCB_AIRCR_VECTKEY_Pos |
					0b011  << SCB_AIRCR_PRIGROUP_Pos; // PRIGROUP = 0b011 (preemption:16, sub:0)
	while((SCB->AIRCR & SCB_AIRCR_PRIGROUP_Msk) != (0b011 << SCB_AIRCR_PRIGROUP_Pos));

	// Global interrupt design in sample project can refer to the following setting.
	// SVC(FreeRTOS)		: preemption:15, IRQn:11, This priority will be modified to lowest priority forcibly in RTOS.
	// PendSV(FreeRTOS)		: preemption:15, IRQn:14, This priority will be modified to lowest priority forcibly in RTOS.
	// Systick(FreeRTOS)	: preemption:15, IRQn:15, This priority will be modified to lowest priority forcibly in RTOS.
	// USART1(Debug)		: preemption:14, IRQn:37
	// TIMER7(LED1 flicker)	: preemption:14, IRQn:55
	// EXIT13(TouchPanel)	: preemption:13, IRQn:40
	// SDIO(FatFs)			: preemption:13, IRQn:49
	// SDDMARx(DMA2_Stream3): preemption:14, IRQn:59
	// SDDMATx(DMA2_Stream6): preemption:14, IRQn:69

	// Initialize SVCall interrupt (IRQn:11)
	SCB->SHPR[2] |= 15 << (24 + 4);
	// SVC need not open. Executing SVC instrument will trigger SVC interrupt.

	// Initialize PendSV interrupt (IRQn:14)
	SCB->SHPR[3] |= 15 << (16 + 4);
	// PendSV need not open. Setting ICSR the 28th bit will trigger pendSV interrupt.

	// Initialize Systick interrupt (IRQn:15)
	SCB->SHPR[3]  |= 15 << (24 + 4);
	SysTick->CTRL |= 0b1 << SysTick_CTRL_TICKINT_Pos;

	// Initialize USART1 interrupt (IRQn:37)
	NVIC->IP[37]  |= 14 << 4;
	NVIC->ISER[1] |= 0b1 << (37 - 32);

#ifdef MODE_STAND_ALONE
	// Initialize TIM7 interrupt (IRQn:55)
	NVIC->IP[13]  |= 14 << (24 + 4);
	NVIC->ISER[1] |= 0b1 << (55 - 32);
#endif

	// Initialize EXTI15_10 interrupt (IRQn:40)
	NVIC->IP[40]  |= 13 << 4;
	NVIC->ISER[1] |= 0b1 << (40 - 32);

	// Initialize SDIO interrupt (IRQn:49)
	//NVIC->IP[49]  |= 13 << 4;
	//NVIC->ISER[1] |= 0b1 << (49 - 32);

	// Initialize SDIO DMARx (DMA2_Stream3) interrupt (IRQn:59)
	//NVIC->IP[59]  |= 14 << 4;
	//NVIC->ISER[1] |= 0b1 << (59 - 32);

