wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
	// Initialize SDIO DMATx (DMA2_Stream6) interrupt (IRQn:69)
	//NVIC->IP[69]  |= 14 << 4;
	//NVIC->ISER[2] |= 0b1 << (69 - 64);
}

#ifdef MODE_STAND_ALONE
static void initTIM7Int(void) // Initialize TIM7 interrupt
{
	// Set TIM7 interrupt priority for LED1 flicker
	NVIC->IP[13] |= 14 << (24 + 4);

	// Enable TIM7 global interrupt (IRQn=55)
	NVIC->ISER[1] |= 0b1 << (55 - 32);

	// Enable TIM7 update interrupt
	TIM7->DIER |= TIM_DIER_UIE;
}
#endif

// SDRAM pin initialization
//  FMC_SDCLK
//  FMC_NBL0   / FMC_NBL1
//  FMC_SDNRAS / FMC_SDNCAS
//  FMC_SDCKE0
//  FMC_SDNE0
//  FMC_SDNWE
//  FMC_BA[0:1]
//  FMC_A[0:11]
//  FMC_D[0:15]
static void initSDRAMGPIO(void)
{
	// GPIOC
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOCEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOCEN_Msk) == 0);
	// PC3  --> FMC_SDCKE0
	GPIOC->MODER	|=	0b10	<< GPIO_MODER_MODER3_Pos;		// MODER = Multiple(0b10)
	GPIOC->OTYPER	|=	0b0		<< GPIO_OTYPER_OT3_Pos;			// OTYPER = PP
	GPIOC->OSPEEDR	|=	0b11	<< GPIO_OSPEEDR_OSPEEDR3_Pos;	// OSPEEDR = Full
	GPIOC->PUPDR	|=	0b00	<< GPIO_PUPDR_PUPDR3_Pos;		// PUPDR = No Pull
	GPIOC->AFR[0]	|=	12		<< GPIO_AFRL_AFRL3_Pos;			// AF12

	// GPIOD
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIODEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIODEN_Msk) == 0);
	// PD0  --> FMC_D2
	// PD1  --> FMC_D3
	// PD8  --> FMC_D13
	// PD9  --> FMC_D14
	// PD10 --> FMC_D15
	// PD14 --> FMC_D0
	// PD15 --> FMC_D1
	GPIOD->MODER	|=	0xA02A000A;	// MODER = Multiple(0b10)
	GPIOD->OTYPER	|=	0x00000000;	// OTYPER = PP
	GPIOD->OSPEEDR	|=	0xF03F000F;	// OSPEEDR = Full
	GPIOD->PUPDR	|=	0x00000000;	// PUPDR = No Pull
	GPIOD->AFR[0]	|=	0x000000CC;	// AF12
	GPIOD->AFR[1]	|=	0xCC000CCC;	// AF12

	// GPIOE
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOEEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOEEN_Msk) == 0);
	// PE0  --> FMC_NBL0
	// PE1  --> FMC_NBL1
	// PE7  --> FMC_D4
	// PE8  --> FMC_D5
	// PE9  --> FMC_D6
	// PE10 --> FMC_D7
	// PE11 --> FMC_D8
	// PE12 --> FMC_D9
	// PE13 --> FMC_D10
	// PE14 --> FMC_D11
	// PE15 --> FMC_D12
	GPIOE->MODER	|=	0xAAAA800A;	// MODER = Multiple(0b10)
	GPIOE->OTYPER	|=	0x00000000;	// OTYPER = PP
	GPIOE->OSPEEDR	|=	0xFFFFC00F;	// OSPEEDR = Full
	GPIOE->PUPDR	|=	0x00000000;	// PUPDR = No Pull
	GPIOE->AFR[0]	|=	0xC00000CC;	// AF12
	GPIOE->AFR[1]	|=	0xCCCCCCCC;	// AF12

	// GPIOF
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOFEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOFEN_Msk) == 0);
	// PF0  --> FMC_A0
	// PF1  --> FMC_A1
	// PF2  --> FMC_A2
	// PF3  --> FMC_A3
	// PF4  --> FMC_A4
	// PF5  --> FMC_A5
	// PF11 --> FMC_SDNRAS
	// PF12 --> FMC_A6
	// PF13 --> FMC_A7
	// PF14 --> FMC_A8
	// PF15 --> FMC_A9
	GPIOF->MODER	|=	0xAA800AAA;	// MODER = Multiple(0b10)
	GPIOF->OTYPER	|=	0x00000000;	// OTYPER = PP
	GPIOF->OSPEEDR	|=	0xFFC00FFF;	// OSPEEDR = Full
	GPIOF->PUPDR	|=	0x00000000;	// PUPDR = No Pull
	GPIOF->AFR[0]	|=	0x00CCCCCC;	// AF12
	GPIOF->AFR[1]	|=	0xCCCCC000;	// AF12

	// GPIOG
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOGEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOGEN_Msk) == 0);
	// PG0  --> FMC_A10
	// PG1  --> FMC_A11
	// PG4  --> FMC_BA0
	// PG5  --> FMC_BA1
	// PG8  --> FMC_SDCLK
	// PG15 --> FMC_SDNCAS
	GPIOG->MODER	|=	0x80020A0A;	// MODER = Multiple(0b10)
	GPIOG->OTYPER	|=	0x00000000;	// OTYPER = PP
	GPIOG->OSPEEDR	|=	0xC0030F0F;	// OSPEEDR = Full
	GPIOG->PUPDR	|=	0x00000000;	// PUPDR = No Pull
	GPIOG->AFR[0]	|=	0x00CC00CC;	// AF12
	GPIOG->AFR[1]	|=	0xC000000C;	// AF12

	// GPIOH
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOHEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOHEN_Msk) == 0);
	// PH3  --> FMC_SDNE0
	// PH5  --> FMC_SDNWE
	GPIOH->MODER	|=	0x00000880;	// MODER = Multiple(0b10)
	GPIOH->OTYPER	|=	0x00000000;	// OTYPER = PP
	GPIOH->OSPEEDR	|=	0x00000CC0;	// OSPEEDR = Full
	GPIOH->PUPDR	|=	0x00000000;	// PUPDR = No Pull
	GPIOH->AFR[0]	|=	0x00C0C000;	// AF12
}

// USART TX pin initialization
static void initUartGPIO(void)
{
	// GPIOA
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOAEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOAEN_Msk) == 0);
	// PA9  --> USART1 TX
	GPIOA->MODER	|=	0b10	<< GPIO_MODER_MODER9_Pos;		// MODER = Multiple(0b10)
	GPIOA->OTYPER	|=	0b0		<< GPIO_OTYPER_OT9_Pos;
	GPIOA->OSPEEDR	|=	0b11	<< GPIO_OSPEEDR_OSPEEDR9_Pos;
	GPIOA->PUPDR	|=	0b01	<< GPIO_PUPDR_PUPDR9_Pos;
	GPIOA->AFR[1]	|=	7		<< GPIO_AFRH_AFRH1_Pos;			// AF7

	// GPIOB
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOBEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOBEN_Msk) == 0);
	// PB7  --> USART1 RX
	GPIOB->MODER	|=	0b10	<< GPIO_MODER_MODER7_Pos;		// MODER = Multiple(0b10)
	GPIOB->OTYPER	|=	0b0		<< GPIO_OTYPER_OT9_Pos;
	// RX line need not to set OSPEEDR and PUPDR
	GPIOB->AFR[0]	|=	7		<< GPIO_AFRL_AFRL7_Pos;			// AF7
}

// LED1 pin initialization
static void initLED1GPIO(void)
{
	// GPIOI
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOIEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOIEN_Msk) == 0);
	// PI1  --> LED1
	GPIOI->MODER	|=	0b01	<< GPIO_MODER_MODER1_Pos;		// MODER = Output
	GPIOI->OTYPER	|=	0b0		<< GPIO_OTYPER_OT1_Pos;
	GPIOI->OSPEEDR	|=	0b11	<< GPIO_OSPEEDR_OSPEEDR1_Pos;
	GPIOI->PUPDR	|=	0b01	<< GPIO_PUPDR_PUPDR1_Pos;
}

// LCD pin initialization
static void initLCDGPIO(void)
{
	// GPIOE
	RCC->AHB1ENR	|= RCC_AHB1ENR_GPIOEEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOEEN_Msk) == 0);
	// PE4  --> LTDC_B0
	GPIOE->MODER	|=	0b10	<< GPIO_MODER_MODER4_Pos;		// MODER = Multiple(0b10)
	GPIOE->AFR[0]	|=	14		<< GPIO_AFRL_AFRL4_Pos;			// AF14

	// GPIOG
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOGEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOGEN_Msk) == 0);
	// PG12 --> LTDC_B4
	GPIOG->MODER	|=	0b10	<< GPIO_MODER_MODER12_Pos;		// MODER = Multiple(0b10)
	GPIOG->AFR[1]	|=	14		<< GPIO_AFRH_AFRH4_Pos;			// AF14

	// GPIOI
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOIEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOIEN_Msk) == 0);
	// PI9  --> LTDC_VSYNC
	// PI10 --> LTDC_HSYNC
	// PI14 --> LTDC_CLK
	// PI15 --> LTDC_R0
	GPIOI->MODER	|=	0b10	<< GPIO_MODER_MODER9_Pos |		// MODER = Multiple(0b10)
						0b10	<< GPIO_MODER_MODER10_Pos |
						0b10	<< GPIO_MODER_MODER14_Pos |
						0b10	<< GPIO_MODER_MODER15_Pos;
	GPIOI->AFR[1]	|=	14		<< GPIO_AFRH_AFRH1_Pos |		// AF14
						14		<< GPIO_AFRH_AFRH2_Pos |
						14		<< GPIO_AFRH_AFRH6_Pos |
						14		<< GPIO_AFRH_AFRH7_Pos;

