wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
	// GPIOJ
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOJEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOJEN_Msk) == 0);
	// PJ0  --> LTDC_R1
	// PJ1  --> LTDC_R2
	// PJ2  --> LTDC_R3
	// PJ3  --> LTDC_R4
	// PJ4  --> LTDC_R5
	// PJ5  --> LTDC_R6
	// PJ6  --> LTDC_R7
	// PJ7  --> LTDC_G0
	// PJ8  --> LTDC_G1
	// PJ9  --> LTDC_G2
	// PJ10 --> LTDC_G3
	// PJ11 --> LTDC_G4
	// PJ13 --> LTDC_B1
	// PJ14 --> LTDC_B2
	// PJ15 --> LTDC_B3
	GPIOJ->MODER	|=	0xA8AAAAAA;	// MODER = Multiple(0b10)
	GPIOJ->AFR[0]	|=	0xEEEEEEEE; // AF14
	GPIOJ->AFR[1]	|=	0xEEE0EEEE; // AF14

	// GPIOK
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOKEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOKEN_Msk) == 0);
	// PK0  --> LTDC_G5
	// PK1  --> LTDC_G6
	// PK2  --> LTDC_G7
	// PK4  --> LTDC_B5
	// PK5  --> LTDC_B6
	// PK6  --> LTDC_B7
	// PK7  --> LTDC_DE
	GPIOK->MODER	|=	0x0000AA2A;	// MODER = Multiple(0b10)
	GPIOK->AFR[0]	|=	0xEEEE0EEE; // AF = AF14

	// GPIOI12 --> LCD_DISP (must be manually controlled)
	GPIOI->MODER	|=	0b01 << GPIO_MODER_MODER12_Pos;		// MODER = Output(0b01)
	GPIOI->OTYPER	|=	0b0  << GPIO_OTYPER_OT12_Pos;		// OTYPER = PP
	GPIOI->BSRR		|=	0b1  << GPIO_BSRR_BS12_Pos;			// Bit Set

	// GPIOK3  --> LCD_BL_CTRL (must be manually controlled)
	GPIOK->MODER	|=	0b01 << GPIO_MODER_MODER3_Pos;		// MODER = Output(0b01)
	GPIOK->OTYPER	|=	0b0  << GPIO_OTYPER_OT3_Pos;		// OTYPER = PP
	GPIOK->BSRR		|=	0b1  << GPIO_BSRR_BS3_Pos;			// Bit Set
}

// Touch panel pin initialization
static void initTouchPanelGPIO(void)
{
	// GPIOH RCC
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOHEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOHEN_Msk) == 0);
	// PH7  --> I2C3_SCL (for FT5336 Control)
	// PH8  --> I2C3_SDA (for FT5336 Control)
	GPIOH->MODER	|=	0b10	<< GPIO_MODER_MODER7_Pos |		// MODER = Multiple(0b10)
						0b10	<< GPIO_MODER_MODER8_Pos;
	GPIOH->OTYPER	|=	0b1		<< GPIO_OTYPER_OT7_Pos |		// Open Drain
						0b1		<< GPIO_OTYPER_OT8_Pos;
	GPIOH->OSPEEDR	|=	0b11	<< GPIO_OSPEEDR_OSPEEDR7_Pos |	// Very high speed
						0b11	<< GPIO_OSPEEDR_OSPEEDR8_Pos;
	GPIOH->PUPDR	|=	0b01	<< GPIO_PUPDR_PUPDR7_Pos |		// Pull-up
						0b01	<< GPIO_PUPDR_PUPDR8_Pos;
	GPIOH->AFR[0]	|=	4		<< GPIO_AFRL_AFRL7_Pos;			// AF4
	GPIOH->AFR[1]	|=	4		<< GPIO_AFRH_AFRH0_Pos;			// AF4

	// GPIOI RCC
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOIEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOIEN_Msk) == 0);
	// PI13 --> LCD_INT (for FT5336 Control)
	GPIOI->MODER	|=	0b00	<< GPIO_MODER_MODER13_Pos;		// MODER = Multiple(0b10)
	GPIOI->OTYPER	|=	0b0		<< GPIO_OTYPER_OT13_Pos;		// Push and pull
	GPIOI->OSPEEDR	|=	0b10	<< GPIO_OSPEEDR_OSPEEDR13_Pos;	// High speed
	GPIOI->PUPDR	|=	0b00	<< GPIO_PUPDR_PUPDR13_Pos;		// No Pull
}

// SDMMC pin initialization
static void initSDMMCGPIO(void)
{
	// GPIOC RCC
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOCEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOCEN_Msk) == 0);
	// PC8  --> SDMMC D0
	// PC9  --> SDMMC D1
	// PC10 --> SDMMC D2
	// PC11 --> SDMMC D3
	// PC12 --> SDMMC CK
	GPIOC->MODER	|=	0x02AA0000;	// MODER = Multiple(0b10)
	GPIOC->OTYPER	|=	0x00000000;	// Push and pull
	GPIOC->OSPEEDR	|=	0x02AA0000;	// High speed
	GPIOC->PUPDR	|=	0x01550000;	// Pull-up
	GPIOC->AFR[1]	|=	0x000CCCCC; // AF12

	// PC13 --> MicroSDcard detect
	GPIOC->MODER	|=	0b00	<< GPIO_MODER_MODER13_Pos;		// MODER = Input(0b00)
	GPIOC->OSPEEDR	|=	0b10	<< GPIO_OSPEEDR_OSPEEDR13_Pos;	// High speed
	GPIOC->PUPDR	|=	0b01	<< GPIO_PUPDR_PUPDR13_Pos;		// Pull-up

	// GPIOD RCC
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIODEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIODEN_Msk) == 0);
	// PD2  --> SDMMC CMD
	GPIOD->MODER	|=	0b10	<< GPIO_MODER_MODER2_Pos;		// MODER = Multiple(0b10)
	GPIOD->OTYPER	|=	0b0		<< GPIO_OTYPER_OT2_Pos;			// Push and pull
	GPIOD->OSPEEDR	|=	0b10	<< GPIO_OSPEEDR_OSPEEDR2_Pos;	// High speed
	GPIOD->PUPDR	|=	0b01	<< GPIO_PUPDR_PUPDR2_Pos;		// Pull-up
	GPIOD->AFR[0]	|=	12		<< GPIO_AFRL_AFRL2_Pos;			// AF12
}

static void setCharBuf06x08(
		const uint16_t symbol,
		const uint32_t foreColor,
		const uint32_t backColor)
{
	assert_param(symbol < 128);

	uint32_t height = sFont.st.head.fontHeight;
	uint32_t width  = sFont.st.cdef[symbol].width;

	uint32_t cnt = 0;
	for (uint32_t i = 0; i < height; i++) {
		for (uint32_t j = 0; j < width; j++) {
			// Because font file is rotated 90 degrees clockwise, the following i and j are exchanged.
			if (sFont.st.cdef[symbol].data[j][0] & (0b1 << (7 - i))) { // use fore color
				charBuffer[cnt++] = (foreColor >>  0) & 0xFF; // blue
				charBuffer[cnt++] = (foreColor >>  8) & 0xFF; // green
				charBuffer[cnt++] = (foreColor >> 16) & 0xFF; // red
				charBuffer[cnt++] = (foreColor >> 24) & 0xFF; // alpha
			}
			else { // use back color
				charBuffer[cnt++] = (backColor >>  0) & 0xFF; // blue
				charBuffer[cnt++] = (backColor >>  8) & 0xFF; // green
				charBuffer[cnt++] = (backColor >> 16) & 0xFF; // red
				charBuffer[cnt++] = (backColor >> 24) & 0xFF; // alpha
			}
		}
	}
}

static void setCharBuf12x16(
		const uint16_t symbol,
		const uint32_t foreColor,
		const uint32_t backColor)
{
	assert_param(symbol < 128);

	uint32_t height = mFont.st.head.fontHeight;
	uint32_t width  = mFont.st.cdef[symbol].width;

	uint32_t cnt = 0;
	for (uint32_t i = 0; i < height; i++) {
		for (uint32_t j = 0; j < width; j++) {
			// Because font file is rotated 90 degrees clockwise, the following i and j are exchanged.
			if (mFont.st.cdef[symbol].data[j][i / 8] & (0b1 << (7 - i % 8))) { // use fore color
				charBuffer[cnt++] = (foreColor >>  0) & 0xFF; // blue
				charBuffer[cnt++] = (foreColor >>  8) & 0xFF; // green
				charBuffer[cnt++] = (foreColor >> 16) & 0xFF; // red
				charBuffer[cnt++] = (foreColor >> 24) & 0xFF; // alpha
			}
			else { // use back color
				charBuffer[cnt++] = (backColor >>  0) & 0xFF; // blue
				charBuffer[cnt++] = (backColor >>  8) & 0xFF; // green
				charBuffer[cnt++] = (backColor >> 16) & 0xFF; // red
				charBuffer[cnt++] = (backColor >> 24) & 0xFF; // alpha
			}
		}
	}
}

static void sdmmcSendCmd(uint8_t cmd, uint32_t arg)
{
	uint8_t resp = 0b01;

	// set WAITRESP area
	switch (cmd) {
	case SD_CMD_GO_IDLE_STATE:
		resp = 0b00; // no response
		break;
	case SD_CMD_ALL_SEND_CID:
	case SD_CMD_SEND_CSD:
		resp = 0b11; // long response
		break;
	default:
		resp = 0b01; // short response
		break;
	}

	// send command
	SDMMC1->ARG	=	arg;
	SDMMC1->CMD	=	cmd << SDMMC_CMD_CMDINDEX_Pos |
					resp << SDMMC_CMD_WAITRESP_Pos |
					0b0 << SDMMC_CMD_WAITINT_Pos | // no interrupt
					0b1 << SDMMC_CMD_CPSMEN_Pos;   // enable CPSM
}

