wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco.c
static uint8_t sdmmcCheckCmdError(void)
{
	uint32_t count = SD_SEND_CMD_TIMEOUT_CNT;
	while((SDMMC1->STA & SDMMC_STA_CMDSENT_Msk) == 0 && count-- != 0);
	SDMMC1->ICR |= 	SDMMC1->STA;

	return count != 0; // count == 0 : timeout
}

static uint8_t sdmmcCheckCmdResp1(uint8_t cmd)
{
	uint32_t count = SD_SEND_CMD_TIMEOUT_CNT;

	// Did not consider CCRCFAIL, CMDREND and CTIMEOUT error flags, because they will cause timeout.
	while ((SDMMC1->STA & SDMMC_STA_CMDACT_Msk) && count-- != 0);
	SDMMC1->ICR |= 	SDMMC1->STA;
	if (count == 0) return 0;

	if ((uint8_t)(SDMMC1->RESPCMD) != cmd) return 0;
	if (SDMMC1->RESP1 & SD_CMD_RESP_R1_ERRORBITS) return 0; // response have been received

	return 1;
}

static uint8_t sdmmcCheckCmdResp2(void)
{
	uint32_t count = SD_SEND_CMD_TIMEOUT_CNT;

	// Did not consider CCRCFAIL, CMDREND and CTIMEOUT error flags, because they will cause timeout.
	while ((SDMMC1->STA & SDMMC_STA_CMDACT_Msk) && count-- != 0);
	SDMMC1->ICR |= 	SDMMC1->STA;
	if (count == 0) return 0;

	return 1;
}

static uint8_t sdmmcCheckCmdResp3(void)
{
	uint32_t count = SD_SEND_CMD_TIMEOUT_CNT;

	// Did not consider CCRCFAIL, CMDREND and CTIMEOUT error flags, because they will cause timeout.
	while ((SDMMC1->STA & SDMMC_STA_CMDACT_Msk) && count-- != 0);
	SDMMC1->ICR |= 	SDMMC1->STA;
	if (count == 0) return 0;

	return 1;
}

static uint8_t sdmmcCheckCmdResp6(uint8_t cmd, uint16_t* pRca)
{
	uint32_t count = SD_SEND_CMD_TIMEOUT_CNT;

	// Did not consider CCRCFAIL, CMDREND and CTIMEOUT error flags, because they will cause timeout.
	while ((SDMMC1->STA & SDMMC_STA_CMDACT_Msk) && count-- != 0);
	SDMMC1->ICR |= 	SDMMC_ICR_CTIMEOUTC_Msk | SDMMC_ICR_CCRCFAILC_Msk | SDMMC_ICR_CMDRENDC_Msk | SDMMC_ICR_CMDSENTC_Msk;
	if (count == 0) return 0;

	if ((uint8_t)(SDMMC1->RESPCMD) != cmd) return 0;

	uint32_t r1 = SDMMC1->RESP1;
	if (r1 & SD_CMD_RESP_R6_ERRORBITS) return 0; // response have been received

	*pRca = (uint16_t)(r1 >> 16);
	return 1;
}

static uint8_t sdmmcCheckCmdResp7(void)
{
	uint32_t count = SD_SEND_CMD_TIMEOUT_CNT;

	// Did not consider CCRCFAIL, CMDREND and CTIMEOUT error flags, because they will cause timeout.
	while ((SDMMC1->STA & SDMMC_STA_CMDACT_Msk) && count-- != 0);
	SDMMC1->ICR |= 	SDMMC1->STA;
	if (count == 0) return 0;

	return 1;
}
